[{"duration":"124min","cast":"Bryce Dallas Howard, Chris Pratt","movieType":"2D","movieRating":"PG","movieStatus":"Now Showing","ratings":3.3,"synoposis":"Located off the coast of Costa Rica, the Jurassic World luxury resort provides a habitat for an array of genetically engineered dinosaurs, including the vicious and intelligent Indominus rex.","director":"Colin Trevorrow","review":[{"feedback":"Overall, this is an enormously entertaining thriller that will delight both newcomers and die-hard fans of the first film alike.","rating":4},{"feedback":"Jurassic World is a surprisingly thrilling blockbuster experience that should leave fans roaring with approval.","rating":4},{"feedback":"Jurassic World is a massive disappointment with a multitude of flaws, from the retreaded story and endless, monotonous action sequences, to the flat, lifeless characters and the uninspired CGI dinosaurs.","rating":2}],"movieID":1,"title":"Jurassic World"},{"duration":"113min","cast":"Dylan O'Brien, Ki Hong Lee","movieType":"3D","movieRating":"NC16","movieStatus":"Now Showing","ratings":3.8,"synoposis":"Thomas (Dylan O'Brien), a teenager, arrives in a glade at the center of a giant labyrinth. Like the other youths dumped there before him, he has no memory of his previous life.","director":"Wes Ball","review":[{"feedback":"Solid enough adaptation of a solid enough YA book. It's no Hunger Games, but it's better than Divergance.","rating":3},{"feedback":"Shows an impressive turn of speed in places but runs out of puff before the finishing line.","rating":4},{"feedback":"Aside from the occasional pot holes in the plot, The Maze Runner is a solid & thrilling adaptation.","rating":4},{"feedback":"It was an excellent movie","rating":4}],"movieID":2,"title":"Maze Runner"},{"duration":"95min","cast":" Steve Carell, Pierre Coffin","movieType":"2D","movieRating":"M18","movieStatus":"Now Showing","ratings":3.7,"synoposis":"A man who delights in all things wicked, supervillain Gru (Steve Carell) hatches a plan to steal the moon. Surrounded by an army of little yellow minions and his impenetrable arsenal of weapons and war machines, Gru makes ready to vanquish all who stand in his way.","director":"Pierre Coffin","review":[{"feedback":"Cute and funny. A very good entertaining movie to the family.","rating":4},{"feedback":"Though not as good as a Pixar film, Despicable Me is still a triumph, especially due to its humor and cute storyline.","rating":4},{"feedback":"Funny and cute as hell, 'Despicable Me' ends up being a cut above the average family-oriented animated flick.","rating":3}],"movieID":3,"title":"Despicable me"},{"duration":"101min","cast":"Adam Sandler, Kevin James, Chris Rock","movieType":"2D","movieRating":"PG","movieStatus":"Now Showing","ratings":2.2,"synoposis":"After having the greatest time of his life three summers ago, Lenny (Adam Sandler), decides he wants to move his family back to his hometown and have them grow up with his gang of childhood friends and their kids. But between old bullies, new bullies, schizophrenic bus drivers, drunk cops on skis, psycho grade school girlfriends and 400 costumed party crashes he finds out that sometimes crazy follows you.","director":" Dennis Dugan","review":[{"feedback":"How can I fully express my total disappointment in this film? It may not be possible. I am one of those who actually liked the first Grown Ups. It had a plot, good characters and lots of fun. The sequel, on the other hand, is pointless, stupid, juvenile, and insulting. Not one redeeming quality in the entire movie. ","rating":1},{"feedback":"When I heard that a second Grown Ups movie was coming out I was immediately excited. Being a a huge fan of the first one; my expectations were very high for the second. Obviously too high. This film had basically no point or plot at all. It was incredibly disappointing.","rating":2},{"feedback":"Grown Ups was alright in my opinion. I tend to enjoy almost any film that is thrown in my direction for some reason or another. Grown Ups had a few laughs which put the label of 'Alright' on it. Below average, but watchable. Grown Ups 2, however, is the worst film I have ever watched. Seriously, if you can find a film that is more terrible than Grown Ups 2, please enlighten me.","rating":1},{"feedback":"To make it simple, Grown-Ups 2 felt like the first, if you enjoyed the first one you will probably enjoy this. I would consider it a mediocre movie if it had of been released in the 90's, but Sandler's movies are becoming extremely repetitive.","rating":3},{"feedback":"Good","rating":4}],"movieID":4,"title":"Grown Ups 2"},{"duration":"137min","cast":"Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth","movieType":"3D","movieRating":"PG","movieStatus":"Coming Soon","ratings":3.0,"synoposis":"Realizing the stakes are no longer just for survival, Katniss Everdeen (Jennifer Lawrence) teams up with her closest friends, including Peeta (Josh Hutcherson), Gale (Liam Hemsworth) and Finnick for the ultimate mission. Together, they leave District 13 to liberate the citizens of war-torn Panem and assassinate President Snow, who's obsessed with destroying Katniss. What lies ahead are mortal traps, dangerous enemies and moral choices that will ultimately determine the future of millions.","director":"Francis Lawrence","review":[{"feedback":"Shit","rating":3}],"movieID":5,"title":"The Hunger Games: Mockingjay, Part 2"},{"duration":"119min","cast":"Mia Wasikowska, Jessica Chastain, Tom Hiddleston","movieType":"2D","movieRating":"NC16","movieStatus":"Preview","ratings":4.5,"synoposis":"When her heart is stolen by a seductive stranger, a young woman is swept away to a house atop a mountain of blood-red clay: a place filled with secrets that will haunt her forever. Between desire and darkness, between mystery and madness, lies the truth behind Crimson Peak.","director":"Guillermo del Toro","review":[{"feedback":"The visuals in Crimson Peak are so glorious, they are almost overwhelming. The sets are spectacular visions of beauty and decadence in decay; costumes are intricately detailed and gorgeous; the lighting and over saturated color bring depth and meaning; the ghosts are grotesquely beautiful; and, of course, the del Toro trademarks of insects and clockwork gracefully found their way into the story as well.","rating":4},{"feedback":"The movie is extremely enchanted. You are submerging to the Victorian era from the first moment, it was like to buy a ticket to the past. The atmosphere is full with mystery and anxiety. The main role here takes the castle. It is unbelievably beautiful, but at the same dark and frightening. I have got the most aesthetic enjoy i ever had.","rating":5}],"movieID":6,"title":"Crimson Peak"},{"duration":"102min","cast":"Kristen Bell, Idina Menzel, Josh Gad","movieType":"2D","movieRating":"PG","movieStatus":"End of Showing","ratings":5.0,"synoposis":"When their kingdom becomes trapped in perpetual winter, fearless Anna (Kristen Bell) joins forces with mountaineer Kristoff (Jonathan Groff) and his reindeer sidekick to find Anna's sister, Snow Queen Elsa (Idina Menzel), and break her icy spell. Although their epic journey leads them to encounters with mystical trolls, a comedic snowman (Josh Gad), harsh conditions, and magic at every turn, Anna and Kristoff bravely push onward in a race to save their kingdom from winter's cold grip.","director":"Jennifer Lee","review":[{"feedback":"Disney has another hit in its repertoire with this heartfelt story of sisterly love and one of the few films released in 3-D this year that splendidly incorporates the technology into the plot line.","rating":5}],"movieID":7,"title":"Frozen"},{"duration":"120min","cast":"cast1, cast2","movieType":"3D","movieRating":"PG","movieStatus":"Now Showing","ratings":2.7,"synoposis":"This is snopsis for new movie","director":"movie director","review":[{"feedback":"This is a new feedback","rating":3},{"feedback":"FEEDBACK FEEDBACK","rating":1},{"feedback":"This movie is sooooooo good.","rating":4}],"movieID":8,"title":"Harry Potter"},{"duration":"150min","cast":"Amirah, Maybelle","movieType":"2D","movieRating":"PG","movieStatus":"End of Showing","ratings":0.0,"synoposis":"Vampire is there in the diaries","director":"Melvin","review":[],"movieID":9,"title":"The Vampire Diaries"}]